In [1]:
import pandas as pd

In [2]:
Employees =pd.DataFrame({
    "Emp ID":[1,2,3],
    "Name":["Harsh","Avinash","Raja"],
    "Dept ID":["10","20","30"]
})

In [4]:
Employees

   Emp ID     Name Dept ID
0       1    Harsh      10
1       2  Avinash      20
2       3     Raja      30

In [7]:
Departments=pd.DataFrame({
    "Dept ID":["10","20","40"],
    "Dept Name":["HR","Engineering","Marketing"]
})

In [8]:
Departments

  Dept ID    Dept Name
0      10           HR
1      20  Engineering
2      40    Marketing

In [10]:
pd.merge(Employees, Departments, on="Dept ID")

   Emp ID     Name Dept ID    Dept Name
0       1    Harsh      10           HR
1       2  Avinash      20  Engineering

In [11]:
pd.merge(Employees,Departments, on ="Dept ID", how="left")

   Emp ID     Name Dept ID    Dept Name
0       1    Harsh      10           HR
1       2  Avinash      20  Engineering
2       3     Raja      30          NaN

In [13]:
pd.merge(Employees,Departments, on ="Dept ID", how="right")

   Emp ID     Name Dept ID    Dept Name
0     1.0    Harsh      10           HR
1     2.0  Avinash      20  Engineering
2     NaN      NaN      40    Marketing

In [15]:
pd.merge(Employees, Departments, on ="Dept ID", how="outer")

   Emp ID     Name Dept ID    Dept Name
0     1.0    Harsh      10           HR
1     2.0  Avinash      20  Engineering
2     3.0     Raja      30          NaN
3     NaN      NaN      40    Marketing